"DETAIL_NAV_TITLE" = "Lisätietoja";

"DUE" = "Määräaika";
"NONE_DUE_DATE" = "Ei";
"DUE_DATE_DETAIL_NAV_TITLE" = "Määräaika";
"HAS_DUE_DATE_SWITCH_TITLE" = "Määräaika";
"SHOW_MORE" = "Näytä lisää…";
"SHOW_LESS" = "Näytä vähemmän…";
"PRIORITY" = "Prioriteetti";

// Priority
"NONE_PRIORITY" = "Ei";
"LOW_PRIORITY" = "Ei tärkeä";
"MEDIUM_PRIORITY" = "Normaali";
"HIGH_PRIORITY" = "Tärkeä";
"PRIORITY_DETAIL_NAV_TITLE" = "Prioriteetti";

// Lists
"REMINDER_LIST" = "Lista";
"LIST_TITLE_DISAMBIGUATION_FORMAT" = "%@ (%@)"; // list name with account name in parentheses

// Alerts
"REMIND_ME" = "Muistuta";
"NONE_REMINDER_ALERT" = "Ei koskaan";
"ON_A_DAY" = "Muistuta tapahtumapäivänä";
"AT_A_LOCATION" = "Muistuta kohteessa";
/* For large text mode, in case the string for AT_A_LOCATION gets truncated */
"AT_A_LOCATION_LARGE_TEXT" = "Kohteessa";
"ON_DUE_DATE_FORMAT" = "%@";
"CURRENT_LOCATION" = "Nykyinen sijainti";
"CHOOSE_ADDRESS" = "Valitse yhteystieto…";
"DETERMINING_LOCATION" = "Määritetään sijaintia…";
"CANNOT_DETERMINE_LOCATION" = "Sijaintia ei voida määrittää";
"MY_ADDRESS_WITHOUT_LABEL" = "Oma osoite"; // in case the My Info card address doesn't have a label
"CONTACT_ADDRESS_WITHOUT_LABEL_FORMAT" = "%@ - osoite"; // in case the contact address doesn't have a label
"CONTACT_ADDRESS_WITH_LABEL_FORMAT" = "%@ - %@"; // e.g. "Steve's Work"
"ALARM_PROXIMITY_FORMAT" = "%@: %@";
"ALARM_PROXIMITY_FORMAT_ARG_ENTER" = "Saavuttaessa";
"ALARM_PROXIMITY_FORMAT_ARG_LEAVE" = "Lähdettäessä";
"DUE_ALL_DAY_FORMAT" = "%@ (koko pv)";
"DUE_AND_LOCATION_EXPLANATORY_FORMAT" = "Saat muistutuksen %@ %@ tai\nviimeistään klo %@ samana päivänä."; // insert line breaks to get it to look right
"DUE_AND_LOCATION_EXPLANATORY_FORMAT_PROXIMITY_ENTER" = "saapuessasi kohteeseen";
"DUE_AND_LOCATION_EXPLANATORY_FORMAT_PROXIMITY_LEAVE" = "lähtiessäsi kohteesta";

// Location
"LOCATION" = "Sijainti";
"NONE_LOCATION" = "Ei";
"ALARM_PROXIMITY_ENTER" = "Saavuttaessa";
"ALARM_PROXIMITY_LEAVE" = "Lähdettäessä";
"LOCATION_PEOPLE_PICKER_PROMPT" = "Valitse yhteystiedon sijainti";
"WIFI_DISABLED_SUBTEXT" = "Ota Wi-Fi käyttöön Asetuksissa sijaintipohjaisten muistutusten tarkkuuden parantamiseksi.";
"WIFI_DISABLED_PROMPT" = "Sijainnin tarkkuus paranee, kun otat Wi-Fin käyttöön Asetuksissa.";
"WLAN_DISABLED_SUBTEXT" = "Ota WLAN käyttöön Asetuksissa sijaintipohjaisten muistutusten tarkkuuden parantamiseksi.";
"WLAN_DISABLED_PROMPT" = "Sijainnin tarkkuus paranee, kun otat WLANin käyttöön Asetuksissa.";
"LOCATION_SERVICES_DISABLED_SUBTEXT" = "Ota Sijaintipalvelut käyttöön Asetuksissa sijaintipohjaisten muistutusten käyttämiseksi.";
"SETTINGS" = "Asetukset";
"TYPED_LOCATION_PLACEHOLDER" = "Syötä osoite…";
"TYPED_LOCATION_GEOCODE_FAILURE" = "Tämän osoitteen sijaintia ei voida määrittää. Tarkista oikeinkirjoitus ja yritä uudelleen.";
"MAP" = "Kartta";
"SHOW_IN_MAP" = "Näytä kartalla";

/* Separator for explanatory text under the Remind Me section (e.g. we need to tell the user their WiFi is off AND explain what a day and location based alarm is.)  E.g. for English it would be \n\n: "Enable Wi-Fi in Settings.\n\nOn Jan 22, you will be reminded when you leave this location, or by 4pm that day at the latest."*/
"REMIND_ME_EXPLANATORY_SEPARATOR" = "\n\n";

// Picking the Me card in the location picker
"ME_CARD_ALERT_TITLE" = "Omat sijainnit";
"ME_CARD_ALERT_BODY" = "Muistutukset voivat käyttää yhteystietoja tarjotakseen sijaintivaihtoehtoja, kuten esimerkiksi koti tai työ. Mitä yhteystietoa käytetään?";
"ME_CARD_ALERT_CHOOSE_BUTTON" = "Valitse";

// For when we need to show raw coordinates for the current location (9487043)
"LOCATION_DEGREES_NORTH" = "P";
"LOCATION_DEGREES_EAST" = "I";
"LOCATION_DEGREES_SOUTH" = "E";
"LOCATION_DEGREES_WEST" = "L";
"LOCATION_DEGREES_FORMAT" = "%d°%d'%.0f'' %@";
"LOCATION_STRING_FORMAT" = "%@, %@";

"CANNOT_SAVE_REMINDER" = "Muistutusta ei voida tallentaa";

"UNTITLED_REMINDER" = "Nimetön";
